Repository: mariamm144/25620125B
Catalog: omegat/project_save.tmx
Source language: en
Languages: es

source: Cook with naan one by one on a hot grill or frying pan until golden brown and cooked through.
es: Cocinala masa una a una en una parrilla caliente o en una sartén hasta que estén doradas y se hayan cocinado.

source: Cooking sushi rice in your Thermomix couldn't be easier!
es: ¡Cocinar arroz para sushi en tu Thermomix no puede ser más fácil!

source: Cool in tin for 5 minutes before transferring to a wire rack to cool completely.
es: Deja enfriar en la bandeja durante 5 minutos antes de transferir a una bandeja de rejilla para enfriar completamente.

source: Cooling Time 30 minutes
es: Tiempo de enfriado 30 minutos

source: Cost$10
es: Precio: 10 dólares

source: Cost$5
es: Precio: 5 dólares

source: Cost $10
es: Coste 9€

source: Cost $2
es: Coste 2€

source: Cost $5
es: Coste 5€

source: Cost$1
es: Coste1€

source: Course Breakfast, Snacks
es: Tipo de platoDesayuno, Tentempié

source: Course Dessert
es: Tipo de plato Postre

source: Course Dinner, main meal, thermomix
es: Tipo de plato Cena, plato principal, thermomix

source: Course Muffins
es: Tipo de plato Muffins

source: Course Snacks
es: Tipo de plato Tentempié

source: Course breads
es: Tipo de plato pan

source: Course healthy snacks
es: Tipo de plato tentempiés saludables

source: CourseBiscuits, Biscuits and Cookies, cookies
es: Tipo de plato Galletas

source: CourseBreakfast, Snacks
es: Tipo de platoDesayuno, Tentempié

source: CourseDessert
es: Tipo de platoPostre

source: CourseDesserts
es: Tipo de platoPostre

source: CourseDinners
es: Tipo de platoCenas

source: CourseDrinks
es: Tipo de platoBebidas

source: Coursebreads
es: Tipo de platopanes

source: Coursehealthy snacks
es: Tipo de platotentempiéssaludables

source: Cover and place in the fridge for 45 minutes - 1 hour to chill.
es: Cúbrela y colócala en la nevera para 45 minutos-1 hora para que se enfríe.

source: Cover and allow to prove for 4 hours at room temperature.
es: Cubre y deja reposar durante 4 horas a temperatura ambiente.

source: Cuisine Australian
es: Cocina Australiana

source: Cuisine Easter
es: Gastronomía Pascua

source: Cuisine Japanese
es: Cocina japonesa

source: Cuisine Western
es: CocinaOccidental

source: Cuisine asian, bao buns, thermomix
es: Gastronomía asiática, bao buns, thermomix

source: Cuisine breads, thermomix
es: Gastronomía panadería, thermomix

source: Cuisine middle eastern
es: Cocina Oriente medio

source: Cuisine party food
es: Gastronomía comida de fiesta

source: CuisineAustralian
es: CocinaAustraliana

source: CuisineAustralian, Western
es: CocinaAustraliana, Occidental

source: CuisineFrench
es: CocinaFrancesa

source: CuisineIndian, thermomix
es: CocinaIndia, thermomix

source: CuisineWestern
es: CocinaOccidente

source: Cuisinehealthy recipes
es: Cocina:tentempiéssaludables

source: Cut 6 X 8cm round holes from each pastry sheet and press into patty pan baking tins.
es: Corta 6 agujeros redondos de 8 cm en cada lámina de hojaldre y presiónalos en moldes para empanadillas.

source: Cut into 12 slices – approximately 2cm thick.
es: Corta en rodajas, aproximadamente 2 cm de grosor.

source: Cut into small pieces with a sharp knife and serve.
es: Corta en trocitos con un cuchillo afilado y sírvelo.

source: Cut the parmesan cheese into cubes no bigger than 3cm and place in your Thermomix bowl to mix for 10 seconds on speed 9 to grate.
es: Corta el queso parmesano en cuadrados de no más de 3 cm y colócalos en tu vaso Thermomix para mezclar durante 10 segundos, velocidad 9 para rallar.

source: Cutting the bread – as delicious as warm bread straight from the oven is… allow it to cool for approximately an hour before slicing.
es: Cortar el pan: aunque esté delicioso recién salido del horno... déjalo enfriar durante aproximadamente una hora antes de cortarlo en rebanadas.

source: Dampen the uncovered end of the nori sheet with water.
es: Humedece el margen de la hoja de nori sin cubrir con agua.

source: Diet Vegetarian
es: Dieta vegetariana

source: Diet vegetarian
es: Dieta vegetariana

source: DietVegetarian
es: DietaVegetariana

source: Divide the dough into approximately 15 - 18 small pieces.
es: Divide la masa en unos 15-18 trozos pequeños.

source: Divide the cookie dough between bowls and flavour however you'd like (see notes).
es: Divide la masa de las galletas entre los cuencos y condimenta a tu gusto (ver en Notas).

source: Divide the dough into 8 equal pieces and roll out into flat ovals.
es: Divide la masa en 8 partes iguales y extiéndelas hasta formar tortitas ovaladas.

source: Divide the mixture evenly between the muffin cases filling to ⅔ full.
es: Reparte la mezcla uniformemente entre los moldes para muffins llenándolos hasta ⅔ de su capacidad.

source: Divide the mixture into 10 portions and use your hands to bring them together before rolling in the flour.
es: Divide la mezcla en 10 porciones y únelas con las manos antes de pasarlas por la harina.

source: Drizzle over the sushi seasoning and fluff with a fork up and allow to cool slightly.
es: Rocía el condimento en el sushi y dale vueltas con un tenedor y deja que se enfríe un poco.

source: Easy Thermomix No-Bake Muesli Bars
es: Barritas de muesli sin horneado fácil en la Thermomix

source: Either fresh or pre-packaged ricotta can be used for this recipe.
es: Para esta receta se puede utilizar ricotta fresca o envasada.

source: Ensure the butter is softened to assist combining with the caster sugar.
es: Asegúrese de que la mantequilla esté blanda para ayudar a combinarla con el azúcar en polvo.

source: Equipment
es: Utensilios:

source: Fill the Thermomix bowl with 500g of water and put the Varoma (with the 2 trays) in place.
es: Llena el vaso Thermomix con 500 ml de agua y coloca la Varoma (con las 2 bandejas).

source: Fluff the rice with a fork – do this gently so as to seperate the rice grains and mix through the seasoning but without squishing the rice.
es: Remueve el arroz con un tenedor, hazlo con delicadeza para separar los granos de arroz y mezcla con el condimento, pero sin aplastar el arroz.

source: Follow our step by step method for making perfect Thermomix sushi every time.
es: Sigue nuestro método paso a paso para hacer siempre un sushi Thermomix perfecto.

source: For a crispy pastry base, I recommend placing the rolls directly onto a greased baking tray.
es: Para obtener una base de hojaldre crujiente, recomiendo colocar los panecillos directamente sobre una bandeja de horno engrasada.

source: For a gluten free version, switch to Gluten Free self-raising flour.
es: Para una versión sin gluten, utilizaharina sin gluten .

source: For a smoother hummus, add 1-2 tablespoons of the reserved chickpea liquid and mix through.
es: Para obtener un humus más suave, añade 1 o 2 cucharadas del líquido de garbanzos reservado y mezcla bien.

source: Freeze in an airtight container for up to 3 months
es: Congelar en un recipiente hermético hasta 3meses

source: Freeze – sourdough freezes beautifully.
es: Congelar: la masa madre se congela estupendamente.

source: Freeze in an airtight container or sealable plastic sandwich bag (like a Glad bag) for up to 3 months.
es: Congela en un recipiente hermético o en una bolsa de plástico sellable para sándwiches (como una Bolsa Glad) durante un máximo de 3 meses.

source: Freezing - freeze in an airtight container for up to 2 months.
es: Congelado:congélalos en un taper hermético hasta 2 meses.

source: Freezing - Freeze muffins in an airtight container for up to 3 months.
es: Congelar - Congela los muffins en un recipiente hermético hasta 3 meses.

source: Frying Pan
es: Una sartén

source: Grease and line a 18cm X 28cm rectangular slice tin with baking paper.
es: Engrasa y alinea una bandeja rectangular de 18cm X 28cm con papel de horno.

source: Grease and line a 20cm square baking tin with baking paper, allowing the sides to overhang.
es: Engrasa y forra un molde cuadrado de 20 cm con papel de horno, dejando que los lados sobresalgan.

source: I like to bake two loaves and freeze one of them.
es: Me gusta hornear dos panes y congelar uno de ellos.

source: I like to use a metal egg flip to transfer my sugar cookies from the bench to my baking tray.
es: A mí me gusta utilizar una paleta de metal para pasar las galletas de azúcar de la mesa a la bandeja del horno.

source: I suggest you remove any excess liquid from the spinach as otherwise the pastry will be soggy.
es: Te aconsejo que quites el líquido sobrante de las espinacas, ya que de lo contrario el hojaldre quedará empapado.

source: I use Tasty Cheese when making this recipe, however you can also use Cheddar, Mozzarella – or a combination of both!
es: Yo uso queso Tasty cuando hago esta receta, pero también puedes usar chédar, mozzarella ¡o una combinación de los dos!

source: I use baby spinach leaves for this recipe, however you can use frozen spinach if you wish.
es: Yo uso hojas de espinacas baby para esta receta, sin embargo se pueden usar espinacas congeladas si lo deseas.

source: I usually ice this Thermomix Marble Cake with a simple chocolate icing however you can also top it with a store bought chocolate or vanilla icing, and it's even delicious served un-iced.
es: Yo suelo cubrir este bizcocho de mármol Thermomix con un simple glaseado de chocolate,aunque también se puede cubrir con un glaseado de chocolate o vainilla comprado en la tienda, e incluso está deliciosa servida sin glaseado.

source: Icing Ingredients
es: Ingredientes para el glaseado

source: If it’s too cold it will be difficult to spread smoothly and you may get holes in your dough.
es: Si está demasiado frío será difícil de untar cómodamente y podrían salir agujeros en la masa.

source: If the mixture is too crumbly - add a little more honey/rice malt syrup and mix again.
es: Si la mezcla está llena de migas,añade un poco más de miel/sirope de arroz malteado y vuelve a remover.

source: If there are still large pieces remaining, blitz for a further 3 seconds, speed 5 until finely grated.
es: Si aún quedan trozos grandes, tritúralos durante otros 3segundos, velocidad 5, hasta que queden finamente rallados.

source: If using solid mini eggs, I would recommend chopping them into smaller pieces before using (this makes the slice easier to cut).
es: Si se utilizan mini huevos macizos, recomendaría picarlos en trozos más pequeños antes de usarlos (esto hace que sea más fácil decortar.)

source: If you don't have a pyrex bowl, you can place a tray of water on the bottom shelf in the oven to create steam.
es: Si no tienes un recipiente mezclador, puedes colocar una bandeja con agua en el estante inferior del horno para crear vapor.

source: If you don't have a Thermomix, you can use a blender or food processor.
es: Si no tienes un aparato Thermomix,puedes usar una batidora o un procesador de alimentos.

source: If you don't have any pink food colouring, different colours can be used or you can divide the mixture into two and have one chocolate and one vanilla.
es: Si no tienes ningún colorante alimentario rosa, puedes utilizar otros colores o dividir la mezcla en dos y tener una de chocolate y otra de vainilla.

source: If you make your scrolls smaller/larger than specified in the recipe, the cooking time will vary.
es: Si haces tus rollitos más grandes o más pequeños que los de la receta, el tiempo de cocina va a variar.

source: If you use baking paper the base of the rolls will not crisp as much.
es: Si usas papel de horno la base de los panecillos no quedará tan crujiente.

source: If you’re baking every 3-4 days, then keep your starter at room temperature and feed it daily.
es: Si horneas cada 3-4 días, mantén el fermento a temperatura ambiente y aliméntalo a diario.

source: If you’re only planning to bake once a week, keep your starter in the fridge and remove it the day before you plan to use it.
es: Si sólo vas a hornear una vez a la semana, guarda el fermento en el frigorífico y sácalo un día antes de utilizarlo.

source: If using a pyrex bowl
es: Si utilizas un vaso mezclador:

source: If using a water tray
es: Si utilizas una bandeja de agua :

source: Ingredients
es: Ingredientes:

source: Instructions
es: Instrucciones

source: It is best consumed fresh within 4 days.
es: Es preferible consumirlo fresco antes de 4 días.

source: It's important that your butter is at room temperature, it will take longer to combine with the caster sugar if it's cold.
es: Es importante que la mantequilla esté a temperatura ambiente, tardará más en mezclarse con el azúcar molido si está fría.

source: It's important to not over mix the ingredients as this will result in a dense muffin.
es: Es importante no mezclar demasiado los ingredientes, ya que el resultado será una magadalena densa.

source: It's very important to chill your dough for 45 minutes - 1 hour, as if you don't it will be too soft to roll and cut into shapes.
es: Es muy importante enfriar la masa entre 45 minutos y 1 hora, ya que de lo contrario estará demasiado blanda para extenderla y cortarla.

source: Knead for 10 minutes of kneading/Interval function.
es: Amasa durante 10 minutos en Función amasado (velocidad espiga).

source: Knead on Interval function for 3 minutes.
es: Amasa en Función amasado (velocidad espiga) durante 3 minutos.

source: Knead the dough on an oiled bench or board.
es: Amasa la masa en la encimera o una tabla con un poco de aceite.

source: Lightly flour a flat baking tray.
es: Enharina ligeramente una bandeja de horno plana.

source: Lightly grease two baking trays and preheat your oven to 210 degrees celsius (fan-forced).
es: Engrasa ligeramente dos bandejas para hornear y precalienta el horno a 210 grados centígrados (con ventilador.)

source: Lightly press down on top of each biscuit to flatten slightly.
es: Presiona suavemente encima de cada galleta para aplanarla un poco.

source: Line a 12 hole muffin tray with paper cases.
es: Forra una bandeja para muffins de 12 agujeros con fundas de papel.

source: Line a large flat baking tray with baking paper and set aside.
es: Forra una bandeja de horno grande y plana con papel de hornear y déjala a un lado.

source: Look after your starter – you need to take care of your starter and feed it!
es: Cuida tu fermento , ¡tienes que cuidarlo y alimentarlo!

source: Made with just a few basic ingredients from your fridge and pantry, you will love how easy this recipe is to put together!
es: Hecha con unos cuantos ingredientes de tu nevera y despensa, ¡te encantará lo fácil que es de preparar!

source: Make sure that your Vegemite is at room temperature before trying to spread it across the dough.
es: Asegúrate de que tu Vegemite está a temperatura ambiente antes de empezar a untarlo.

source: Make the night before – save yourself time and make your sushi the night before.
es: Hazlo la noche de antes, ahorra tiempo y haz tu sushi la noche anterior.

source: Make your own Thermomix Sourdough Loaf with our simple step-by-step recipe using starter, flour, water and salt.
es: Prepara tu propia masa madre Thermomix con nuestra sencilla receta paso a paso a base de fermento, harina, agua y sal.

source: Mash for 10 seconds, Speed 8.
es: Machácalos durante 10 segundos, velocidad 8.

source: Melt the butter in the Thermomix for 2 minutes, 80 degrees, Speed 2 (or until melted).
es: Derrite la mantequilla en la Thermomix, a 80 grados, velocidad 2 (o hasta que se derrita).

source: Melt the chocolate in a clean and dry Thermomix bowl for 3 minutes, 60 degrees, Speed 2 (or until melted).
es: Derrite el chocolate en el vaso Thermomix (limpio y seco) durante 3 minutos, a 60 grados, velocidad 2 (o hasta que esté derretido.)

source: Mix for 1 minute, Speed 5 (scrape down the sides after 30 seconds).
es: Remuévelo durante 1 minuto a la velocidad 5 (raspa los laterales del bol pasados los 30 segundos).

source: Mix for 20 seconds on Speed 4.
es: Mezcla durante 20 segundos, velocidad 4.

source: Mix for a further 2 minutes using the dough/interval function.
es: Remuévelo durante 2 minutos más usando la función de masa/intervalos.

source: Mix for a further 20 seconds on Speed 4.
es: Mezcla durante otros 20 segundos, velocidad 4.

source: Mix for another 10 seconds, Speed 5, or until just combined - it’s fine if the mixture is a little lumpy.
es: Mezcla durante 10 segundos más, velocidad 5, o hasta que la mezcla esté bien removida; no pasa nada si la mezcla está un poco grumosa.

source: Mix for two minutes at 37 degrees on speed 1.
es: Mezcla durante dos minutos a 37 grados, velocidad 1.

source: Mix on for 10 minutes, 100 degrees, Speed 1. It needs to heat for this long to allow the mixture to thicken enough.
es: Mecla durante 10 minutos, a 100 grados, velocidad 1. Necesita calentarse tanto tiempo para que la mezcla se espese lo suficiente.

source: Muffins are best consumed within 1-2 days of baking.Note: do not store muffins in the fridge as this will dry them out.
es: Los muffins se consumen mejor en los 1-2 días siguientes a suhorneado. Nota: no guarde los muffins en el frigorífico, ya que se secarían.

source: Muffins are best consumed within 2-3 days of baking.
es: Los muffins es mejor consumirlos entre 2-3 días después de hornearlos.

source: Note: If your mixture is too crumbly, add a little more sweetened condensed milk and mix again for 5 seconds.
es: Nota: Si la mezcla tiene muchos grumos, añade más leche condensada y mezcla otros 5 segundos

source: Notes
es: Notas:

source: Nutrition
es: Valores nutricionales:

source: Oats - use rolled oats or quick oats.
es: La avena:utiliza avena en copos o precocida.

source: On a lightly floured board, knock the air out of the dough and form into a tight ball.
es: Sobre una encimera ligeramente enharinada, elimina el aire de la masa y forma una bola compacta.

source: Once completely cool, combine your icing ingredients in a bowl.
es: Una vez totalmente enfriadas, mezcla tus glaseados en un bol.

source: Once cool, decorate as desired.
es: Una vez frías, decorar al gusto.

source: Once the dough has chilled, preheat your oven to 180 degrees celsius (fan forced) and line two trays with baking paper.
es: Una vez que la masa se haya enfriado, precalienta el horno a 180 grados centígrados (con ventilador) y forra dos bandejas con papel de cocina.

source: Once you've made homemade hummus in your Thermomix, you'll never buy store-bought hummus again!
es: Una vez que hagas humus casero en tu Thermomix, ¡no volverás a comprarlo!

source: Our Thermomix Apple Loaf recipe makes a great sweet treat for the whole family.
es: Nuestra receta de pan de manzana con Thermomix es un dulce estupendo para toda la familia.

source: Our Thermomix Focaccia is the perfect side to a bowl of soup or pasta... or completely delicious all on it's own (with butter, of course!).
es: Nuestra Focaccia con Thermomix es el acompañamiento perfecto para un plato de sopa o pasta... o completamente deliciosa sola(¡con mantequilla, por supuesto!)

source: Our Thermomix Healthy Apricot Balls are the perfect lunchbox snack - made from apricots, coconut, rolled oats, chia seeds, coconut oil and rice malt syrup... ready in just 5 minutes!
es: Nuestras saludables bolitas de albaricoque con Thermomix son perfectas para merendar. Hechas de albaricoque, coco, copos de avena, semillas de chía, aceite de coco y sirope de arroz malteado, ¡se preparan en tan sólo 5 minutos!

source: Our Thermomix Iced Coffee Frappe recipe makes the creamiest and most delicious caffeine hit ever!
es: Nuestra receta de Frappe de café helado con Thermomix es el golpe de cafeína más cremoso y delicioso que existe.

source: Our classic Thermomix Hummus recipe takes just 2 minutes to prepare and is made from 6 pantry staple ingredients.
es: Nuestra receta clásica de Hummus Thermomix se prepara en sólo 2 minutos y se elabora con 6 ingredientes básicos de la despensa.

source: Our famous Thermomix Pikelet recipe can be ready to enjoy in less than 30 minutes!
es: ¡Nuestra famosa receta de Pikelets en la Thermomix puede estar lista en menos de 30 minutos!

source: Our soft and fluffy Thermomix Bao Buns served with leftover roast pork and crunchy Asian slaw make the perfect family dinner.
es: Nuestros suaves y esponjosos bollos Bao con Thermomix servidos con sobras de cerdo asado y crujiente ensalada asiática son la cena familiar perfecta.

source: Our super easy Thermomix Condensed Milk Cookies are the perfect biscuit jar filler!
es: ¡Nuestras facilísimas galletas de leche condensada con Thermomix son perfectas para llenar el bote de galletas!

source: Oven
es: Un horno

source: Peel the apple and roughly chop it into pieces no bigger than 1cm.
es: Pela la manzana y córtala en trozos de no más de 1 cm.

source: Perfect for a hot day, our smooth iced coffee frappe will give you the energy boost you need!
es: Perfecto para un día caluroso, nuestro suave frappe de café helado te dará la energía que necesitas.

source: Place all of the ingredients into your Thermomix bowl and blend for 3 minutes, Speed 6.
es: Introduce todos los ingredientes en el vaso de tu Thermomix y bate durante 3 minutos, velocidad 6.

source: Place a nori sheet on top of the sushi mat with the rough side facing up.
es: Coloca una hoja de nori encima de la esterilla de sushi con la parte rugosa hacia fuera.

source: Place a sushi bamboo mat (these can be bought from the Asian section of the supermarket) onto a flat bench.
es: Pon una esterilla de bambú de sushi (se pueden comprar en la sección asiática en el supermercado) en una superficie plana.

source: Place all ingredients (except for the sesame/poppy seeds) into the Thermomix bowl.
es: Coloca todos los ingredientes (excepto las semillas de sésamo/amapola) en el vaso de Thermomix.

source: Place bananas into the Thermomix bowl.
es: Coloca los plátanos en el vaso de la Thermomix.

source: Place into a warm spot and allow to rise (this will take approximately 1 hour).
es: Coloca la masa en un lugar cálido y deja que fermente (esto tomará aporximadamente 1 hora).

source: Place into the fridge for 2 hours (overnight is best).
es: Mételo en el frigorífico durante 2horas (mejor toda la noche).

source: Place into the oven to bake for 10 - 12 minutes or until the edges of the biscuits start to turn golden.
es: Colócalas en el horno durante 10-12 minutos o hasta que los bordes de las galletas queden dorados.

source: Place on a baking tray and sprinkle with the remaining grated cheese.
es: Coloca en la bandeja de hornear y espolvorea con el queso rallado restante

source: Place onto your baking trays.
es: Colócalas en las bandejas de horno.

source: Place small pieces of baking paper onto half of each flattened oval and fold over (so that the baking paper is in between.
es: Coloca pequeños trozos de papel de hornear sobre la mitad de cada óvalo aplanado y dóblalo (de modo que el papel de hornear quede en medio).

source: Place the cut out sugar cookies onto your prepared trays and continue until all of the dough has been used.
es: Coloca las galletas de azúcar recortadas en las bandejas preparadas y continúa hasta que hayas utilizado toda la masa.

source: Place the self raising flour, caster sugar, butter, vanilla extract, eggs and milk into your Thermomix bowl and mix for 15 seconds, speed 5.
es: Pon la harinacon levadura, el azúcar molido, la mantequilla, el extracto de vainilla, los huevos y la leche en el bol de la Thermomix y mézclelos durante 15 segundos, velocidad 5.

source: Place the pyrex bowl over the top of the dough to form a dome.
es: Coloca el vaso mezclador sobre la parte superior de la masa para formar una cúpula.

source: Place the Apple Loaf into your oven and bake for 50 - 55 minutes or until cooked when tested with a skewer.
es: Coloca el molde con la masa en el horno y cocínala durante 50-55 minutos o hasta que estén hechos al probarlos con una brocheta.
